## production: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                             |
|----------|--------------------------------------------------------------|
| update   | `aws_acm_certificate.internal_dns`                           |
| recreate | `aws_route53_zone.internal_dns`                              |
|          | `aws_secretsmanager_secret_version.internal_dns_cert_base64` |
|          | `aws_secretsmanager_secret_version.internal_dns_fqdn`        |
|          | `tls_self_signed_cert.internal_dns`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
16:04:37.437 STDOUT terraform:   ~ update in-place
16:04:37.437 STDOUT terraform: -/+ destroy and then create replacement
16:04:37.437 STDOUT terraform: +/- create replacement and then destroy
16:04:37.437 STDOUT terraform: Terraform will perform the following actions:
16:04:37.437 STDOUT terraform:   # aws_acm_certificate.internal_dns will be updated in-place
16:04:37.437 STDOUT terraform:   ~ resource "aws_acm_certificate" "internal_dns" {
16:04:37.437 STDOUT terraform:       ~ certificate_body          = <<-EOT
16:04:37.437 STDOUT terraform:             -----BEGIN CERTIFICATE-----
16:04:37.438 STDOUT terraform:             MIIDHjCCAgagAwIBAgIRAKhhQ17rvifVLLIJ+5dt4qYwDQYJKoZIhvcNAQELBQAw
16:04:37.438 STDOUT terraform:             LzEtMCsGA1UEAxMkcHJvZHVjdGlvbi5ub3RpZmljYXRpb24uaW50ZXJuYWwuY29t
16:04:37.438 STDOUT terraform:             MB4XDTI0MDIxMzE2NTQwMloXDTI5MDIxMTE2NTQwMlowLzEtMCsGA1UEAxMkcHJv
16:04:37.438 STDOUT terraform:             ZHVjdGlvbi5ub3RpZmljYXRpb24uaW50ZXJuYWwuY29tMIIBIjANBgkqhkiG9w0B
16:04:37.438 STDOUT terraform:             AQEFAAOCAQ8AMIIBCgKCAQEAxwl3Dda3kIzyDVPykNgP/LWeLeRxyF9Sip7eBl+L
16:04:37.438 STDOUT terraform:             /d6HNNnuBLSiKNUZ6EDyo587d68Kx0y4EvzsfahJD7qh25TG5yr+IMqovAAJ3sjF
16:04:37.438 STDOUT terraform:             kSfKVZtyZgE15te1wbBsD5Jsf3nBttbgbxrD/kKxYdRqP4Oy8p1edBIivsEC22vc
16:04:37.438 STDOUT terraform:             qYvuu0Iz1OOJ1iZppXAybC59wM8+K0u1BPqx2Zr8VhZHldlcFmjC2Og4wYPvpSPt
16:04:37.438 STDOUT terraform:             XG//Fpbhe2V+9RcXjFobrBmBOqUrXCxIHICmlBYBgN5cTn7P1aKuzShUX/spnN++
16:04:37.438 STDOUT terraform:             z2PpKxZJHXxt1YfJwmbg6a1M3NqnODBAxIZsAA7NeTdlVwIDAQABozUwMzAOBgNV
16:04:37.438 STDOUT terraform:             HQ8BAf8EBAMCBaAwEwYDVR0lBAwwCgYIKwYBBQUHAwEwDAYDVR0TAQH/BAIwADAN
16:04:37.438 STDOUT terraform:             BgkqhkiG9w0BAQsFAAOCAQEAkaEamL1FlGlDfjom/z3DCyYTnYrMIcMVPPHGPKR2
16:04:37.438 STDOUT terraform:             omOw516Ra8mM1MdqAfnU+n2b49hcvD4CTCcckV8Yq+W9z3UNNfbaOPCzAK/WGf9y
16:04:37.438 STDOUT terraform:             eurTrE+VtP61l1R5I8082109ZgZtusHz+IkvYIfTI+0cICN1kpcdRM1LHgSJF4v2
16:04:37.438 STDOUT terraform:             NckGfY5dfHBtjQIT9pw98mxU4RMIxvCvGImABC6OxrT72O5wBPbT/t4tzMvy1JPV
16:04:37.438 STDOUT terraform:             g9YjmXqSD7qOki+dVmIwnyihozZFTHZtP1ISGZixQ+F3SVr8XvnaLueWnYMgS4zq
16:04:37.438 STDOUT terraform:             5IDBcQmJvFxhKGxFZiOU4BkiBo4iz4V8LeCfoi6ClJELMA==
16:04:37.439 STDOUT terraform:             -----END CERTIFICATE-----
16:04:37.439 STDOUT terraform:         EOT -> (known after apply)
16:04:37.439 STDOUT terraform:         id                        = "arn:aws:acm:ca-central-1:296255494825:certificate/66f4d857-1e0a-4b4d-8c48-f2b5d2ac87c1"
16:04:37.439 STDOUT terraform:         tags                      = {
16:04:37.439 STDOUT terraform:             "CostCenter" = "notification-canada-ca-production"
16:04:37.439 STDOUT terraform:             "Name"       = "notification-canada-ca"
16:04:37.439 STDOUT terraform:         }
16:04:37.439 STDOUT terraform:         # (19 unchanged attributes hidden)
16:04:37.439 STDOUT terraform:         # (1 unchanged block hidden)
16:04:37.439 STDOUT terraform:     }
16:04:37.439 STDOUT terraform:   # aws_route53_zone.internal_dns must be replaced
16:04:37.439 STDOUT terraform: +/- resource "aws_route53_zone" "internal_dns" {
16:04:37.439 STDOUT terraform:       ~ arn                 = "arn:aws:route53:::hostedzone/Z04975098KBSPJVVBZDG" -> (known after apply)
16:04:37.439 STDOUT terraform:       ~ id                  = "Z04975098KBSPJVVBZDG" -> (known after apply)
16:04:37.439 STDOUT terraform:       ~ name                = "production.notification.internal.com" -> "notification.prv" # forces replacement
16:04:37.439 STDOUT terraform:       ~ name_servers        = [
16:04:37.439 STDOUT terraform:           - "ns-0.awsdns-00.com.",
16:04:37.439 STDOUT terraform:           - "ns-1024.awsdns-00.org.",
16:04:37.439 STDOUT terraform:           - "ns-1536.awsdns-00.co.uk.",
16:04:37.439 STDOUT terraform:           - "ns-512.awsdns-00.net.",
16:04:37.439 STDOUT terraform:         ] -> (known after apply)
16:04:37.439 STDOUT terraform:       ~ primary_name_server = "ns-0.awsdns-00.com." -> (known after apply)
16:04:37.439 STDOUT terraform:       - tags                = {} -> null
16:04:37.439 STDOUT terraform:       ~ tags_all            = {} -> (known after apply)
16:04:37.439 STDOUT terraform:       ~ zone_id             = "Z04975098KBSPJVVBZDG" -> (known after apply)
16:04:37.439 STDOUT terraform:         # (3 unchanged attributes hidden)
16:04:37.440 STDOUT terraform:       - vpc {
16:04:37.440 STDOUT terraform:           - vpc_id     = "vpc-0e02e0295db594518" -> null
16:04:37.440 STDOUT terraform:           - vpc_region = "ca-central-1" -> null
16:04:37.440 STDOUT terraform:         }
16:04:37.440 STDOUT terraform:       + vpc {
16:04:37.440 STDOUT terraform:           + vpc_id     = "vpc-0e02e0295db594518"
16:04:37.440 STDOUT terraform:           + vpc_region = (known after apply)
16:04:37.440 STDOUT terraform:         }
16:04:37.440 STDOUT terraform:     }
16:04:37.440 STDOUT terraform:   # aws_secretsmanager_secret_version.internal_dns_cert_base64 must be replaced
16:04:37.440 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "internal_dns_cert_base64" {
16:04:37.440 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:INTERNAL_DNS_CERT_BASE64-UexaEv" -> (known after apply)
16:04:37.440 STDOUT terraform:       + has_secret_string_wo = (known after apply)
16:04:37.440 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:INTERNAL_DNS_CERT_BASE64-UexaEv|terraform-20240213165402214300000004" -> (known after apply)
16:04:37.440 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
16:04:37.440 STDOUT terraform:       ~ version_id           = "terraform-20240213165402214300000004" -> (known after apply)
16:04:37.440 STDOUT terraform:       ~ version_stages       = [
16:04:37.440 STDOUT terraform:           - "AWSCURRENT",
16:04:37.440 STDOUT terraform:         ] -> (known after apply)
16:04:37.440 STDOUT terraform:         # (4 unchanged attributes hidden)
16:04:37.440 STDOUT terraform:     }
16:04:37.440 STDOUT terraform:   # aws_secretsmanager_secret_version.internal_dns_fqdn must be replaced
16:04:37.440 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "internal_dns_fqdn" {
16:04:37.440 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:INTERNAL_DNS_FQDN-nWHxbQ" -> (known after apply)
16:04:37.440 STDOUT terraform:       + has_secret_string_wo = (known after apply)
16:04:37.441 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:INTERNAL_DNS_FQDN-nWHxbQ|terraform-20240213165402194600000003" -> (known after apply)
16:04:37.441 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
16:04:37.441 STDOUT terraform:       ~ version_id           = "terraform-20240213165402194600000003" -> (known after apply)
16:04:37.441 STDOUT terraform:       ~ version_stages       = [
16:04:37.441 STDOUT terraform:           - "AWSCURRENT",
16:04:37.441 STDOUT terraform:         ] -> (known after apply)
16:04:37.441 STDOUT terraform:         # (4 unchanged attributes hidden)
16:04:37.441 STDOUT terraform:     }
16:04:37.441 STDOUT terraform:   # tls_self_signed_cert.internal_dns must be replaced
16:04:37.441 STDOUT terraform: +/- resource "tls_self_signed_cert" "internal_dns" {
16:04:37.441 STDOUT terraform:       ~ cert_pem              = <<-EOT
16:04:37.441 STDOUT terraform:             -----BEGIN CERTIFICATE-----
16:04:37.441 STDOUT terraform:             MIIDHjCCAgagAwIBAgIRAKhhQ17rvifVLLIJ+5dt4qYwDQYJKoZIhvcNAQELBQAw
16:04:37.441 STDOUT terraform:             LzEtMCsGA1UEAxMkcHJvZHVjdGlvbi5ub3RpZmljYXRpb24uaW50ZXJuYWwuY29t
16:04:37.441 STDOUT terraform:             MB4XDTI0MDIxMzE2NTQwMloXDTI5MDIxMTE2NTQwMlowLzEtMCsGA1UEAxMkcHJv
16:04:37.441 STDOUT terraform:             ZHVjdGlvbi5ub3RpZmljYXRpb24uaW50ZXJuYWwuY29tMIIBIjANBgkqhkiG9w0B
16:04:37.441 STDOUT terraform:             AQEFAAOCAQ8AMIIBCgKCAQEAxwl3Dda3kIzyDVPykNgP/LWeLeRxyF9Sip7eBl+L
16:04:37.441 STDOUT terraform:             /d6HNNnuBLSiKNUZ6EDyo587d68Kx0y4EvzsfahJD7qh25TG5yr+IMqovAAJ3sjF
16:04:37.441 STDOUT terraform:             kSfKVZtyZgE15te1wbBsD5Jsf3nBttbgbxrD/kKxYdRqP4Oy8p1edBIivsEC22vc
16:04:37.441 STDOUT terraform:             qYvuu0Iz1OOJ1iZppXAybC59wM8+K0u1BPqx2Zr8VhZHldlcFmjC2Og4wYPvpSPt
16:04:37.441 STDOUT terraform:             XG//Fpbhe2V+9RcXjFobrBmBOqUrXCxIHICmlBYBgN5cTn7P1aKuzShUX/spnN++
16:04:37.441 STDOUT terraform:             z2PpKxZJHXxt1YfJwmbg6a1M3NqnODBAxIZsAA7NeTdlVwIDAQABozUwMzAOBgNV
16:04:37.441 STDOUT terraform:             HQ8BAf8EBAMCBaAwEwYDVR0lBAwwCgYIKwYBBQUHAwEwDAYDVR0TAQH/BAIwADAN
16:04:37.441 STDOUT terraform:             BgkqhkiG9w0BAQsFAAOCAQEAkaEamL1FlGlDfjom/z3DCyYTnYrMIcMVPPHGPKR2
16:04:37.442 STDOUT terraform:             omOw516Ra8mM1MdqAfnU+n2b49hcvD4CTCcckV8Yq+W9z3UNNfbaOPCzAK/WGf9y
16:04:37.442 STDOUT terraform:             eurTrE+VtP61l1R5I8082109ZgZtusHz+IkvYIfTI+0cICN1kpcdRM1LHgSJF4v2
16:04:37.442 STDOUT terraform:             NckGfY5dfHBtjQIT9pw98mxU4RMIxvCvGImABC6OxrT72O5wBPbT/t4tzMvy1JPV
16:04:37.442 STDOUT terraform:             g9YjmXqSD7qOki+dVmIwnyihozZFTHZtP1ISGZixQ+F3SVr8XvnaLueWnYMgS4zq
16:04:37.442 STDOUT terraform:             5IDBcQmJvFxhKGxFZiOU4BkiBo4iz4V8LeCfoi6ClJELMA==
16:04:37.442 STDOUT terraform:             -----END CERTIFICATE-----
16:04:37.442 STDOUT terraform:         EOT -> (known after apply)
16:04:37.442 STDOUT terraform:       ~ id                    = "223815322528993327248986020499520610982" -> (known after apply)
16:04:37.442 STDOUT terraform:       ~ key_algorithm         = "RSA" -> (known after apply)
16:04:37.442 STDOUT terraform:       ~ validity_end_time     = "2029-02-11T16:54:02.205560189Z" -> (known after apply)
16:04:37.442 STDOUT terraform:       ~ validity_start_time   = "2024-02-13T16:54:02.205560189Z" -> (known after apply)
16:04:37.442 STDOUT terraform:         # (8 unchanged attributes hidden)
16:04:37.442 STDOUT terraform:       ~ subject { # forces replacement
16:04:37.442 STDOUT terraform:           ~ common_name = "production.notification.internal.com" -> "notification.prv" # forces replacement
16:04:37.442 STDOUT terraform:         }
16:04:37.442 STDOUT terraform:     }
16:04:37.442 STDOUT terraform: Plan: 4 to add, 1 to change, 4 to destroy.
16:04:37.442 STDOUT terraform: Changes to Outputs:
16:04:37.442 STDOUT terraform:   ~ internal_dns_name                     = "production.notification.internal.com" -> "notification.prv"
16:04:37.442 STDOUT terraform:   ~ internal_dns_zone_id                  = "Z04975098KBSPJVVBZDG" -> (known after apply)
16:04:37.442 STDOUT terraform:   ~ notification_internal_dns_cert        = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURIakNDQWdhZ0F3SUJBZ0lSQUtoaFExN3J2aWZWTExJSis1ZHQ0cVl3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa2NISnZaSFZqZEdsdmJpNXViM1JwWm1sallYUnBiMjR1YVc1MFpYSnVZV3d1WTI5dApNQjRYRFRJME1ESXhNekUyTlRRd01sb1hEVEk1TURJeE1URTJOVFF3TWxvd0x6RXRNQ3NHQTFVRUF4TWtjSEp2ClpIVmpkR2x2Ymk1dWIzUnBabWxqWVhScGIyNHVhVzUwWlhKdVlXd3VZMjl0TUlJQklqQU5CZ2txaGtpRzl3MEIKQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBeHdsM0RkYTNrSXp5RFZQeWtOZ1AvTFdlTGVSeHlGOVNpcDdlQmwrTAovZDZITk5udUJMU2lLTlVaNkVEeW81ODdkNjhLeDB5NEV2enNmYWhKRDdxaDI1VEc1eXIrSU1xb3ZBQUozc2pGCmtTZktWWnR5WmdFMTV0ZTF3YkJzRDVKc2YzbkJ0dGJnYnhyRC9rS3hZZFJxUDRPeThwMWVkQklpdnNFQzIydmMKcVl2dXUwSXoxT09KMWlacHBYQXliQzU5d004K0swdTFCUHF4MlpyOFZoWkhsZGxjRm1qQzJPZzR3WVB2cFNQdApYRy8vRnBiaGUyVis5UmNYakZvYnJCbUJPcVVyWEN4SUhJQ21sQllCZ041Y1RuN1AxYUt1elNoVVgvc3BuTisrCnoyUHBLeFpKSFh4dDFZZkp3bWJnNmExTTNOcW5PREJBeElac0FBN05lVGRsVndJREFRQUJvelV3TXpBT0JnTlYKSFE4QkFmOEVCQU1DQmFBd0V3WURWUjBsQkF3d0NnWUlLd1lCQlFVSEF3RXdEQVlEVlIwVEFRSC9CQUl3QURBTgpCZ2txaGtpRzl3MEJBUXNGQUFPQ0FRRUFrYUVhbUwxRmxHbERmam9tL3ozREN5WVRuWXJNSWNNVlBQSEdQS1IyCm9tT3c1MTZSYThtTTFNZHFBZm5VK24yYjQ5aGN2RDRDVENjY2tWOFlxK1c5ejNVTk5mYmFPUEN6QUsvV0dmOXkKZXVyVHJFK1Z0UDYxbDFSNUk4MDgyMTA5WmdadHVzSHorSWt2WUlmVEkrMGNJQ04xa3BjZFJNMUxIZ1NKRjR2MgpOY2tHZlk1ZGZIQnRqUUlUOXB3OThteFU0Uk1JeHZDdkdJbUFCQzZPeHJUNzJPNXdCUGJUL3Q0dHpNdnkxSlBWCmc5WWptWHFTRDdxT2tpK2RWbUl3bnlpaG96WkZUSFp0UDFJU0daaXhRK0YzU1ZyOFh2bmFMdWVXbllNZ1M0enEKNUlEQmNRbUp2RnhoS0d4RlppT1U0QmtpQm80aXo0VjhMZUNmb2k2Q2xKRUxNQT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
16:04:37.443 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
16:04:37.443 STDOUT terraform: Saved the plan to: plan.tfplan
16:04:37.443 STDOUT terraform: To perform exactly these actions, run the following command to apply:
16:04:37.443 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"chrc-ccdp.gc.ca\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"notification.gov.bc.ca\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"notify.novascotia.ca\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca-receiving"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
